# Пример консольного вывода работы SMTP-клиента

## Пример 1: Успешная отправка письма через локальный тестовый сервер

### Терминал 1 - Запуск тестового SMTP-сервера:
```
$ python3 -m smtpd -n -c DebuggingServer localhost:25
```

### Терминал 2 - Запуск SMTP-клиента:
```
$ ./smtp_client localhost test@example.com recipient@test.com "Hello World" "This is a test message from SMTP client"

=== Запуск SMTP-клиента ===
Сервер: localhost
От: test@example.com
Кому: recipient@test.com
Тема: Hello World
================================

Сокет создан успешно
Разрешён хост localhost -> 127.0.0.1
Подключение к localhost:25...
Подключение установлено
S: 220 MacBook-Pro.local Python SMTP proxy version 0.3
C: HELO example.com
S: 250 MacBook-Pro.local
C: MAIL FROM:<test@example.com>
S: 250 OK
C: RCPT TO:<recipient@test.com>
S: 250 OK
C: DATA
S: 354 End data with <CR><LF>.<CR><LF>
C: [Email content]
S: 250 OK
Письмо успешно отправлено!
C: QUIT
S: 221 Bye
Соединение закрыто
```

### Терминал 1 - Полученное письмо на сервере:
```
---------- MESSAGE FOLLOWS ----------
b'From: test@example.com'
b'To: recipient@test.com'
b'Subject: Hello World'
b'X-Peer: 127.0.0.1'
b''
b'This is a test message from SMTP client'
------------ END MESSAGE ------------
```

## Пример 2: SMTP-диалог в деталях

```
$ ./smtp_client localhost admin@mycompany.com user@client.com "Meeting Tomorrow" "Hi, let's meet tomorrow at 10 AM"

=== Запуск SMTP-клиента ===
Сервер: localhost
От: admin@mycompany.com
Кому: user@client.com
Тема: Meeting Tomorrow
================================

Сокет создан успешно
Разрешён хост localhost -> 127.0.0.1
Подключение к localhost:25...
Подключение установлено
S: 220 localhost ESMTP Postfix
C: HELO example.com
S: 250 localhost
C: MAIL FROM:<admin@mycompany.com>
S: 250 2.1.0 Ok
C: RCPT TO:<user@client.com>
S: 250 2.1.5 Ok
C: DATA
S: 354 End data with <CR><LF>.<CR><LF>
C: [Email content]
S: 250 2.0.0 Ok: queued as A1B2C3D4E5
Письмо успешно отправлено!
C: QUIT
S: 221 2.0.0 Bye
Соединение закрыто
```

## Пример 3: Ошибка при использовании неверного сервера

```
$ ./smtp_client nonexistent.server.com test@test.com user@user.com "Test" "Test"

=== Запуск SMTP-клиента ===
Сервер: nonexistent.server.com
От: test@test.com
Кому: user@user.com
Тема: Test
================================

Сокет создан успешно
Не удалось разрешить имя хоста: nonexistent.server.com
Не удалось подключиться к SMTP-серверу
```

## Пример 4: Ошибка подключения (сервер не запущен)

```
$ ./smtp_client localhost test@test.com user@user.com "Test" "Test"

=== Запуск SMTP-клиента ===
Сервер: localhost
От: test@test.com
Кому: user@user.com
Тема: Test
================================

Сокет создан успешно
Разрешён хост localhost -> 127.0.0.1
Подключение к localhost:25...
Ошибка подключения к серверу
Не удалось подключиться к SMTP-серверу
```

## Инструкция по тестированию

1. **Компиляция:**
   ```bash
   make
   ```

2. **Запуск тестового SMTP-сервера** (в отдельном терминале):
   ```bash
   python3 -m smtpd -n -c DebuggingServer localhost:25
   ```
   
   Если порт 25 требует sudo:
   ```bash
   sudo python3 -m smtpd -n -c DebuggingServer localhost:25
   ```

3. **Отправка тестового письма:**
   ```bash
   ./smtp_client localhost sender@example.com receiver@example.com "Test Subject" "Test message body"
   ```

4. **Проверка результата:**
   - В терминале с SMTP-клиентом должно быть сообщение "Письмо успешно отправлено!"
   - В терминале с SMTP-сервером должен отобразиться полный текст полученного письма

## Примечания

- Для работы с портом 25 могут потребоваться права администратора (sudo)
- Публичные SMTP-серверы обычно требуют аутентификацию и TLS, поэтому базовая версия клиента лучше всего работает с локальным тестовым сервером
- Все SMTP-команды и ответы логируются в консоль для отладки
- Формат вывода: "C:" - команда от клиента, "S:" - ответ от сервера
